InformationRegisters/НастройкаПодписиСсылочныхДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкаПодписиСсылочныхДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаПодписиСсылочныхДанных/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает таблицу значений, содержащую соответствующие значения записей регистра.
//	
// Возвращаемое значение:
//	ТаблицаЗначений - колонки соответствуют именам измерений регистра
//
Функция ПолучитьДанныеРегистра() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкаПодписиСсылочныхДанных.ТипДанных КАК ТипДанных,
	|	НастройкаПодписиСсылочныхДанных.ИмяРеквизита КАК ИмяРеквизита
	|ИЗ
	|	РегистрСведений.НастройкаПодписиСсылочныхДанных КАК НастройкаПодписиСсылочныхДанных";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Заполняет данными регистр сведений НастройкаПодписиСсылочныхДанных
//
// Параметры:
//  УдалитьВсеСуществующие - Булево. Если Истина, то все существующие записи регистра 
//   будут удалены перед заполнением
//  ДанныеФайла - ХранилищеЗначения, двоичные данные загружаемого файла
//
// Возвращает Истина, если файлы успешно загружены
//
Функция ЗагрузитьНастройкиИзФайла(УдалитьВсеСуществующие, ДанныеФайла = Неопределено) Экспорт
	
	СоответствиеСчетДт = Новый Соответствие;
	НаборЗаписей = РегистрыСведений.НастройкаПодписиСсылочныхДанных.СоздатьНаборЗаписей();
	
	НенайденныеСчета = Новый Массив;
	
	Если Не УдалитьВсеСуществующие Тогда
		
		СуществующиеЗаписи = ПолучитьДанныеРегистра();
		
	Иначе
		СуществующиеЗаписи = Новый ТаблицаЗначений;
		СуществующиеЗаписи.Колонки.Добавить("ТипДанных");
		СуществующиеЗаписи.Колонки.Добавить("ИмяРеквизита");
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	
	Попытка
		Если ДанныеФайла <> Неопределено Тогда
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
			ДвоичныеДанные = ДанныеФайла.Получить();
			ДвоичныеДанные.Записать(ИмяВременногоФайла);
			Файл = Новый Файл(ИмяВременногоФайла);
			ЧтениеXML.ОткрытьФайл(Файл.ПолноеИмя);
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение загрузки настроек электронной подписи'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;
		
	Попытка
		ЧтениеXML.ПерейтиКСодержимому();  		// FileContent
		ЧтениеXML.ПрочитатьАтрибут();  			// xmlns:nspxml
		ЧтениеXML.ПрочитатьАтрибут();			// RecordCount
		КоличествоСтрок = XMLЗначение(Тип("Число"), ЧтениеXML.Значение);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение загрузки настроек электронной подписи'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;
	
	ДобавленныеЗаписи = Новый ТаблицаЗначений;
	ДобавленныеЗаписи.Колонки.Добавить("ТипДанных", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных"));
	ДобавленныеЗаписи.Колонки.Добавить("ИмяРеквизита", Новый ОписаниеТипов("Строка"));
	
	ИндексЗаписи = -1;
	
	Пока (Истина) Цикл
		
		ИндексЗаписи = ИндексЗаписи + 1;
		
		ТипДанныхСтрока = "";
		ИмяРеквизита = "";
		
		Попытка
			
			ЧтениеXML.Прочитать(); // <Record>
			Если ЧтениеXML.Имя = "FileContent" Тогда
				Прервать; // Закончились записи Record.
			КонецЕсли;
			
			ЧтениеXML.Прочитать(); // <ТипДанных>
			ЧтениеXML.Прочитать();
			Если ЧтениеXML.ИмеетЗначение Тогда
				ТипДанныхСтрока = ЧтениеXML.Значение;
				ЧтениеXML.Прочитать(); // </ТипДанных>
			КонецЕсли;
			
			ЧтениеXML.Прочитать(); // <ИмяРеквизита>
			ЧтениеXML.Прочитать();
			Если ЧтениеXML.ИмеетЗначение Тогда
				ИмяРеквизита = ЧтениеXML.Значение;
				ЧтениеXML.Прочитать(); // </ИмяРеквизита>
			КонецЕсли;
			
			ЧтениеXML.Прочитать(); // </Record>
			
		Исключение
			Возврат Ложь;
		КонецПопытки;
		
		ТипДанных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипДанныхСтрока, Ложь);
		
		Если НЕ ЗначениеЗаполнено(ТипДанных) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ошибка при заполнении настроек: тип данных %1 не найден.'"), ТипДанныхСтрока));
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("ТипДанных, ИмяРеквизита", ТипДанных, ИмяРеквизита);
		НетВСуществующихЗаписях = СуществующиеЗаписи.НайтиСтроки(Отбор).Количество() = 0;
		Если УдалитьВсеСуществующие ИЛИ НетВСуществующихЗаписях Тогда
			Если ДобавленныеЗаписи.НайтиСтроки(Отбор).Количество() = 0 Тогда
				НоваяЗаписьТаб = ДобавленныеЗаписи.Добавить();
				НоваяЗаписьТаб.ТипДанных = ТипДанных;
				НоваяЗаписьТаб.ИмяРеквизита = ИмяРеквизита;
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, НоваяЗаписьТаб);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
	НаборЗаписей.Записать(УдалитьВсеСуществующие);
	
	Если ИмяВременногоФайла <> Неопределено Тогда
		Попытка
			УдалитьФайлы(ИмяВременногоФайла);
		Исключение
			// обработка исключения не требуется
		КонецПопытки;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Сохраняет записи из регистра сведений в файл XML.
//
Процедура СохранитьНастройкиВФайл(ИмяФайла) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкаПодписиСсылочныхДанных.ИмяРеквизита КАК ИмяРеквизита,
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя КАК ТипДанных
	|ИЗ
	|	РегистрСведений.НастройкаПодписиСсылочныхДанных КАК НастройкаПодписиСсылочныхДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО НастройкаПодписиСсылочныхДанных.ТипДанных = ИдентификаторыОбъектовМетаданных.Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выгрузка = Новый ЗаписьXML;
	Выгрузка.ОткрытьФайл(ИмяФайла);
	
	Выгрузка.ЗаписатьОбъявлениеXML();
	Выгрузка.ЗаписатьНачалоЭлемента("FileContent");
	Выгрузка.ЗаписатьСоответствиеПространстваИмен("nspxml", "http://www.w3.org/2001/XMLSchema");
	Выгрузка.ЗаписатьАтрибут("RecordCount", Формат(Выборка.Количество(), "ЧГ=0"));
	
	Пока Выборка.Следующий() Цикл
		
		Выгрузка.ЗаписатьНачалоЭлемента("Record");
		
		Выгрузка.ЗаписатьНачалоЭлемента("ТипДанных");
		Выгрузка.ЗаписатьТекст(Выборка.ТипДанных);
		Выгрузка.ЗаписатьКонецЭлемента();
		
		Выгрузка.ЗаписатьНачалоЭлемента("ИмяРеквизита");
		Выгрузка.ЗаписатьТекст(Выборка.ИмяРеквизита);
		Выгрузка.ЗаписатьКонецЭлемента();
		
		Выгрузка.ЗаписатьКонецЭлемента(); // Record
		
	КонецЦикла;
	
	Выгрузка.ЗаписатьКонецЭлемента(); // FileContent
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
